{"pageProps":{"post":{"title":"How to Obtain Shiny Pokémon in Pokémon Quest","thumbnail":"/images/uploads/shiny-pokemon-quest.jpeg","content":"<p>When I was a kid, I remember encountering my very first Shiny Pokémon. It was in Pokémon Ruby and I was surfing around, minding my own business, when suddenly that familiar battle music started playing. That's when a flash of stars appeared around a wild Wingull, me not knowing what that meant, defeated the Wingull and carried on about my business. Back to present day, I now know I made a huge mistake by not catching that Wingull, as it was a 1 in 8192 chance of it appearing 😭. Luckily I can fulfil my Shiny hunting dreams in Pokémon Quest, and so can you!</p>\n<h3>What exactly is a Shiny Pokémon?</h3>\n<p>A Shiny Pokémon is a rare variant of a Pokémon, that has a different colour variation of its normal form. The variation in colour can be substantial for some Pokémon, whereas others will have less notable differences. For example Caterpie has a major difference in its colour when it's Shiny, whereas Gengar has a very subtle colour difference as you can see below:</p>\n<p><img src=\"/images/uploads/gengar-caterpie.jpeg\" alt=\"Shiny difference of Caterpie and Gengar\" title=\"Shiny Pokemon Comparison\"></p>\n<p>In other Pokémon games when a Shiny Pokémon is encountered, as I've mentioned before, a set of stars appears around the Pokémon and in later games, a set of squares can also shown around a Shiny Pokémon. However, this is not the case in Pokémon Quest as it can only be visually distinguished with its change in colour.</p>\n<p>Once you obtain a Shiny Pokémon, if at anytime it were to evolve, it will keep its Shiny status across evolutions. However, the colouring for its shiny evolution might be different to that of previous evolutions, so if you like a particular colour palette of a Shiny Pokémon, make sure that when you evolve them that you're going to be happy with that evolution's colour variation, otherwise you might be stuck with a Shiny Pokémon you don't like.</p>\n<h3>How do I get a Shiny Pokémon in Pokémon Quest?</h3>\n<p>Obtaining Shiny Pokémon in Pokémon Quest is very simple, anytime you cook a dish to attract a Pokémon to your base camp, or when you take in your daily visitor Pokémon, there will be a slight chance that they will be Shiny. The exact probability/chance of receiving a Shiny Pokémon seems to be unknown from the handful of articles, subreddit posts and Discord conversations. The consensus is that it's much easier than the 1 in 4096 in most mainline games, and some articles floated around the chances of being around the 1 in 75 and 1 in 100 range, which seems to be likely from my experience of Shiny hunting in this game.</p>\n<p>Just a word of warning, make sure you stay vigilant when you obtain new Pokémon, as I made the mistake of using up a Shiny Abra on an Alakazam I was training, only to find out a few weeks later, due to seeing the star icon next to Abra's entry in the Pokédex, that I messed up. So if you're unsure that a Pokémon you've obtained is Shiny, check the Pokédex for the star icon, and by tapping the Pokémon's model preview which will switch it to the Pokémon's Shiny variant.</p>\n<p><img src=\"/images/uploads/abra-shiny-comparison.jpeg\" alt=\"Abra Pokédex Shiny Comparison\" title=\"Abra Pokédex Entry\"></p>\n<p>There is one method people use to Shiny hunt efficiently, which is changing your clock time, to trick the game into giving you a new Pokémon visitor, which refreshes every 22 hours. Or you stick with the legitimate method of cooking dishes.</p>\n<p>If you want to hunt for a specific shiny Pokémon, you can look at the Pokémon recipe section of this web app <a href=\"https://pokequestrecipes.me/pokemon\">here</a>! For some Pokémon like <a href=\"https://pokequestrecipes.me/pokemon/jynx\">Jynx</a>, it can be quite rare to obtain them, plus it's even rarer to obtain them as a Shiny Pokémon. What might be a better strategy is Shiny hunting using the <a href=\"https://pokequestrecipes.me/types/mulligan-stew-a-la-cube\">Mulligan Stew a la Cube</a> dish which will allow you to randomly get a Shiny from the large pool of Pokémon that can be found within that dish.</p>\n<h3>Are Shiny Pokémon stronger?</h3>\n<p>You would think that having a super difficult to obtain variant of a Pokémon would mean they would be significantly stronger. Unfortunately this is not the case in any Pokémon game, including Pokémon Quest. Who cares anyway? You've got a cool, badass rare variant of Pokémon, what more could you want?</p>\n<p>Good luck in your Shiny hunting trainers!</p>\n","slug":"how-to-obtain-shiny-pokemon-in-pokemon-quest","date":"2021-10-12T22:04:21.804Z"}},"__N_SSG":true}